const puzzles = {
    "n5": {
        "8-9-24": {
            "answers": {
                "across": [
                    "おかあさん",
                ],
                "down": [
                    "おとうさん",
                    "あに"
                ]
            },
            "clues": {
                "across": [
                    "1. Mother",
                    "3. "
                ],
                "down": [
                    "1. Father",
                    "2. Older brother"
                ]
            },
            "grid": [
                "お", "か", "あ", "さ", "ん",
                "と", ".", "に", ".", ".",
                "う", ".", ".", ".", ".",
                "さ", ".", ".", ".", ".",
                "ん", ".", ".", ".", "."
            ],
            "gridnums": [
                1, 0, 2, 0, 0,
                0, 0, 0, 0, 0,
                0, 0, 0, 0, 0,
                3, 0, 0, 0, 0,
                0, 0, 0, 0, 0,
            ],
            "size": {
                "cols": 5,
                "rows": 5
            }
        }
    }
}
